driver-tests/bpelse/assign/AssignJbi/test/echoNMTOKENSDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoNMTOKENSDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoNMTOKENSDataType">
    <string>NMTOKENS</string>
    <normalizedString>NMTOKENS</normalizedString>
    <token>NMTOKENS</token>
    <base64Binary>NMTOKENS</base64Binary>
    <hexBinary>NMTOKENS</hexBinary>
    <integer>NMTOKENS</integer>
    <positiveInteger>NMTOKENS</positiveInteger>
    <negativeInteger>NMTOKENS</negativeInteger>
    <nonNegativeInteger>NMTOKENS</nonNegativeInteger>
    <nonPositiveInteger>NMTOKENS</nonPositiveInteger>
    <long>NMTOKENS</long>
    <unsignedLong>NMTOKENS</unsignedLong>
    <int>NMTOKENS</int>
    <unsignedInt>NMTOKENS</unsignedInt>
    <short>NMTOKENS</short>
    <unsignedShort>NMTOKENS</unsignedShort>
    <byte>NMTOKENS</byte>
    <unsignedByte>NMTOKENS</unsignedByte>
    <decimal>NMTOKENS</decimal>
    <float>NMTOKENS</float>
    <double>NMTOKENS</double>
    <boolean>NMTOKENS</boolean>
    <duration>NMTOKENS</duration>
    <dateTime>NMTOKENS</dateTime>
    <date>NMTOKENS</date>
    <time>NMTOKENS</time>
    <gYear>NMTOKENS</gYear>
    <gYearMonth>NMTOKENS</gYearMonth>
    <gMonth>NMTOKENS</gMonth>
    <gMonthDay>NMTOKENS</gMonthDay>
    <gDay>NMTOKENS</gDay>
    <Name>NMTOKENS</Name>
    <QName>NMTOKENS</QName>
    <NCName>NMTOKENS</NCName>
    <anyURI>NMTOKENS</anyURI>
    <language>NMTOKENS</language>
    <ID>NMTOKENS</ID>
    <IDREF>NMTOKENS</IDREF>
    <IDREFS>NMTOKENS</IDREFS>
    <ENTITY>NMTOKENS</ENTITY>
    <ENTITIES>NMTOKENS</ENTITIES>
    <NMTOKEN>NMTOKENS</NMTOKEN>
    <NMTOKENS>NMTOKENS</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
